#Реалізуйте введення даних у один рядок до двовимірного масиви цілих чисел. Забезпечте коректність введення даних у двовимірний список.
# Перевірте, чи даний двовимірний список цілих чисел має вертикальну вісь симетрії.
x = print("Введите ряды целых чисел через пробел для заполнения таблицы. Когда закончите нажмите ^: ")
a=[]

flag = True
while flag:
    i = 0
    n=input("Ряд ")
    a.append([])
    for c in list(n):
        if c=='^':
            print(c)
            flag = False
            break
        else:
            a.append([i])
            a[i].append(c)
            i=i+1

print(a)