#Задача 5.
#Відомості про автомобіль складаються із назви марки, унікального
#номера авто та прізвища власника. Словник формується наступним
#чином: ключ - номер авто та значення - список із двох елементів
#[марка, прізвище власника]. Реалізуйте алгоритм пошуку прізвища власника за допомогою
#номера та виведіть статистику унікальних марок.
avto={}
avto['123455']=['BMV','ANN']
avto['88888']=['NISSAN','OLEG']
avto['99999']=['KIA','VASYA']
avto['44444']=['KIA','Petro']
nom=input("Введите номер авто")
p=0
b=[]

for i in avto:
    b.append(avto[i][0])
    if i==nom:
        print("Машина")
        print(avto[i])
        p=1
        break
if p==0:
    print("Нет в базе таокго номера")
print("Уникальные значения")
c=set(b)
print(c)




