#Задача 4
'''Петро та Олена грають у гру. Петро загадує натуральне число від  1 до 100. Олена намагається вгадати це число,
називаючи деяку множину натуральних чисел через кому. Якщо число присутнє у цій множині, то Петро каже “Yes”,
якщо його не має — “No”. Після декількох запитань Олена заплуталася і не пам’ятає,
які питання задавала та просить у Петра допомоги “HELP”, у відповідь Петро називає ті числа, які казала Олена і серед яких є правильна відповідь.'''
import random
ch=random.randint(1,100)
flag=True
mas_ch=[]
while flag:

    n=0
    o_ch=input("Олено скажи свої числа через , :")
    if o_ch!='HELP':
        mas_o=o_ch.split(',')

        for i in range(len(mas_o)):
            if ch==int(mas_o[i]):
                print("Выиграла")
                flag=False
                break
            else:
                b=mas_o[i]

                mas_ch.append(b)

                print(mas_o[i])
                print("No no no")
        n=n+1
    else:
        mas_ch.append(ch)
        print(mas_ch)




