#Задача 2
#Задано рядок із слів, які розділені пробілом. Обчисліть кількість слів у рядку та виведіть на екран статистику кількості унікальних слів.
str=input("Введите фразу:")
arr=[]
arr=str.split()
print("Количество слов = %.0f " % len(arr))
setarr = set(arr)
if len(arr) == len(setarr):
    print("Все элементы уникальны")
else:
    print("Есть одинаковые. Количество уникальніх слов = %.0f слова" % len(setarr))
